# Titanic: Data Preparation and Analysis

- In this homework assignment, you will practice data loading, preparation, transformation and analysis.
- Follow each *TODO* instruction to write a Python code snippet with pandas. 
- After you finish coding and debugging, click the `Cell` tab, select `Run All`, and then save the notebook that includes the output of each code cell.

In [1]:
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Load data from files `train.csv` and `test.csv` into two DataFrames `train` and `test`, respectively. Display the first six rows of the two DataFrames, respectively.

In [2]:
#####TODO 1#####
pass
from IPython.display import display

train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
print('First 6 row of dataframe train:')
display(train.head(6))
print('\nFirst 6 row of dataframe test:')
test.head(6)

First 6 row of dataframe train:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

First 6 row of dataframe test:

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S

**TODO 2**
Find the number of columns in the `train` and `test` DataFrames, respectively.

In [3]:
#####TODO 2#####
pass
print('Number of columns in train are: ' + str(train.shape[1]))
print('Number of columns in test are: ' + str(test.shape[1]))

Number of columns in train are: 12
Number of columns in test are: 11

**TODO 3** 
Show the names of all columns in the `train` DataFrame with an `object` data type.

In [4]:
#####TODO 3#####
pass
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**TODO 4**
Show the names of all columns in the `train` DataFrame with missing values.

In [5]:
#####TODO 4#####
pass
train.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

**TODO 5**
Find the ticket class with the highest number of passengers in the `train` DataFrame.

In [6]:
#####TODO 5#####
pass
train.Pclass.value_counts().idxmax()

3

**TODO 6**
Find the ticket class with the highest survival rate in the `train` DataFrame.

*Hint*: use `train.groupby()`.

In [7]:
#####TODO 6#####
pass
train[['Pclass', 'Survived']].groupby(['Pclass']).mean().idxmax()

Survived    1
dtype: int64

**TODO 7**
Column `Embarked`stores the port of embarkation for each passenger. Find the number of missing values in this column of both DataFrames separately. Then fill in any missing value in this column with the port of the highest frequency in the `train` DataFrame. Finally, re-calculate the number of missing values in this column to verify your operations.

In [8]:
#####TODO 7#####
pass
print('Number of missing values in Embarked of train: ' + str(train.Embarked.isna().sum()))
print('Number of missing values in Embarked of test: ' + str(test.Embarked.isna().sum()))
train.Embarked.fillna(train.Embarked.value_counts().idxmax(), inplace=True)
test.Embarked.fillna(train.Embarked.value_counts().idxmax(), inplace=True)
print('Number of missing values in Embarked of train: ' + str(train.Embarked.isna().sum()))
print('Number of missing values in Embarked of test: ' + str(test.Embarked.isna().sum()))

Number of missing values in Embarked of train: 2
Number of missing values in Embarked of test: 0
Number of missing values in Embarked of train: 0
Number of missing values in Embarked of test: 0

**TODO 8** Output the number of rows in the `train` DataFrame with field `Embarked` equal to 'S'.

In [9]:
#####TODO 8#####
pass
train.Embarked.value_counts().S

646

**TODO 9** Column `Fare` stores the  the tickt fare each passenger paid. Find the number of missing values in this column of both DataFrames separately. If a DataFrame has missing values in this column, then fill in any missing value with the mean ticket fare of the same ticket class in the `train` DataFrame. Finally, re-calculate the number of missing values in this column to verify your operations.

In [10]:
#####TODO 9#####
pass
print('Number of missing values in Fare of train: ' + str(train.Fare.isna().sum()))
print('Number of missing values in Fare of test: ' + str(test.Fare.isna().sum()))
test.Fare.fillna(train.Fare[train.Pclass == 3].mean(), inplace = True)
print('Number of missing values in Fare of test: ' + str(test.Fare.isna().sum()))

Number of missing values in Fare of train: 0
Number of missing values in Fare of test: 1
Number of missing values in Fare of test: 0

**TODO 10** 
Output the ticket fare of the passenger in the `test` DataFrame with field `PassengerId` equal to 1044.

In [11]:
#####TODO 10#####
pass
test.Fare[test.PassengerId == 1044]

152    13.67555
Name: Fare, dtype: float64

**TODO 11**
Compute the survival rate under each distinct level of field `Parch` in the `train` DataFrame.

In [12]:
#####TODO 11#####
pass
train[['Parch', 'Survived']].groupby(['Parch']).mean()

       Survived
Parch
0      0.343658
1      0.550847
2      0.500000
3      0.600000
4      0.000000
5      0.200000
6      0.000000

**TODO 12**
Convert the data in column 'Sex' to 1 for 'male' and 0 for 'female' in both DataFrames. Then find the number of zeros in this column of the `train` DataFrame.

In [13]:
####TODO 12####
pass
train.Sex.replace({'male' : 1, 'female' : 0}, inplace = True)
test.Sex.replace({'male' : 1, 'female' : 0}, inplace = True)
sum(train.Sex == 0)

314

**TODO 13** 
Fill in the missing values in column `Age` with the mean age in the `train` DataFrame. Then compute the mean age in the `test` DataFrame.

In [14]:
#####TODO 13#####
pass
test.Age.fillna(train.Age.mean(), inplace = True)
test.Age.mean()

30.15460315226568

**TODO 14** Add a column `IsChild` to both DataFrames. Assign 1 to this column if a passenger's age is below 16 years old, or 0 otherwise. Then compute the column total. 

*Hint*: use `DataFrame.apply()`. You may define a function.

In [15]:
#####TODO 14#####
pass
def ischild(age):
    if age < 16:
        return 1
    else:
        return 0

train['IsChild'] = train.Age.apply(ischild)
print('The total of column IsChild in train: ' + str(train.IsChild.sum()))
test['IsChild'] = test.Age.apply(ischild)
print('The total of column IsChild in test: ' + str(test.IsChild.sum()))

The total of column IsChild in train: 83
The total of column IsChild in test: 32

**TODO 15** 
Compute the survival rates of children and adults in the `train` DataFrame.

In [16]:
#####TODO 15#####
pass
train[['IsChild', 'Survived']].groupby(['IsChild']).mean()

         Survived
IsChild
0        0.362624
1        0.590361